Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་དང་ཡོངས་སུ་ལྡན་པའི་སེམས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བར་བྱ་ཞིང་། དགེ་བའི་རྩ་བ་རྣམས་ལ་ཆགས་པར་ཡང་མི་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should, with an attitude of great compassion, dedicate their roots of virtue toward the benefit of beings, and so that suffering beings may come to maturity. They should be unattached to their roots of virtue.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་བྱང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་བའི་བར་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created unfathomably numerous roots of virtue in order to understand the origin as related to knowledge of purification. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood, and then teach beings how to understand the origin as related to knowledge of purification?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་རྒྱལ་སྲིད་ཤིན་ཏུ་ཚིམ་པ་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one called One Who Satisfies the Kingdom with Rain from Dharma Clouds;

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་རྒྱལ་སྲིད་ཤིན་ཏུ་ཚིམ་པ་དེའི་སྐུ་ཚེའི་ཚད་ལོ་བྱེ་བར་གྱུར་ཏོ། །
en: That Thus-Gone One would live to be ten million years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་རྒྱལ་སྲིད་ཤིན་ཏུ་ཚིམ་པ་དེའི་ཉན་ཐོས་འདུས་པ་ཉན་ཐོས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །
en: The thus-gone, worthy, perfect buddha One Who Satisfies the Kingdom with Rain from Dharma Clouds

source: རྣམ་གྲངས་འདིས་ན་ཉན་ཐོས་འདུས་པ་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །
en: had innumerable assemblies of hearers that numbered many millions of beings,

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ཡང་དེ་བཞིན་ནོ། །
en: and similar assemblies of bodhisattvas.

source: ཉན་ཐོས་ཤེས་རབ་ཀྱིས་རྣམ་པར་མ་གྲོལ་བ་གང་ཡང་མེད་དེ། །ཐམས་ཅད་ཀྱང་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ་ཤ་སྟག་གོ །
en: All of them without exception had been liberated through insight, and meditated on the eight liberations.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་ཡོངས་སུ་དག་པ་བརྗོད་དུ་མེད་པར་ཡང་དག་པར་རབ་ཏུ་གནས་པར་མ་གྱུར་པ་གང་ཡང་མེད་དོ། །
en: All the bodhisattvas without exception had dwelled among countless and indescribably many pure buddha realms.

source: དེའི་ཚེ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་གནས་མེད་པའི་སྒྲ་དབྱངས་ལ་ལྷག་པར་མོས་པ་ཡང་དག་པར་གནས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “At that time there was a great brahmin householder, a bodhisattva named One Who Dwells in Devotion to the Non-Abiding Melody.

source: དེ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་རྒྱལ་སྲིད་ཤིན་ཏུ་ཚིམ་པ་དེ་ལ་ཡིད་དུ་འཐད་དེ། ཡིད་དུ་མི་འཐད་པ་མ་ཡིན་པས་ལོ་བྱེ་བ་ཐམ་པར་རིམ་གྲོ་པ་བྱས་ཏེ་བཤད་པ་ཡང་འཛིན་ལ་རང་གི་དོན་ཀྱང་མི་གཏོང་ངོ་། །
en: For ten million years he served the thus-gone One Who Satisfies the Kingdom with Rain from Dharma Clouds, always pleasing him and never displeasing him. He cherished his teachings but did not let go of his selfish pursuits.

source: དེ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་རྒྱལ་སྲིད་ཤིན་ཏུ་ཚིམ་པ་དེས་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་རིམ་གྲོ་པ་བྱེད་པ་འདི་དེ་བཞིན་གཤེགས་པར་འགྱུར་བར་ཡོངས་སུ་གཟིགས་ཀྱང་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ། །
en: The thus-gone One Who Satisfies the Kingdom with Rain from Dharma Clouds saw that through his service with the mind of awakening, the householder would become a thus-gone one, and yet did not prophesy his unsurpassed and perfect awakening.

source: འདི་ལྟར་དེ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མངོན་པར་ཞེན་པའི་ཕྱིར་རོ། །
en: Because the householder was so fixated on the mind of awakening.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གནས་མེད་པའི་སྒྲ་དབྱངས་ལ་ལྷག་པར་མོས་པ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva named One Who Dwells in Devotion to the Non-Abiding Melody was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གནས་མེད་པའི་སྒྲ་དབྱངས་ལ་ལྷག་པར་མོས་པ་ཡང་དག་པར་གནས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva named One Who Dwells in Devotion to the Non-Abiding Melody.

source: ཡང་དག་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་ང་དེ་བཞིན་གཤེགས་པ་དེའི་རིམ་གྲོ་པ་བྱས་ཀྱང་ང་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མངོན་པར་ཞེན་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ཏོ། །
en: I served the Thus-Gone One genuinely with the mind of awakening, and yet, because I was so fixated on the mind of awakening, the Thus-Gone One never prophesied my unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should not be fixated on the mind of awakening.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་བྱང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created unfathomably numerous roots of virtue in order to understand cessation as related to knowledge of purfication. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood, and then teach beings?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བྲམ་ཟེ་སྤྲིན་སྒྲོགས་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a brahmin named Cloud Proclaimer, who was similar to a sal tree.

source: ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ནས་ནོར་རྫས་དང་། ཡོ་བྱད་མང་བ་ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། གསེར་དང་། དངུལ་གྱི་བར་དག་རབ་ཏུ་མང་བ།
en: He was rich, prosperous, and wealthy, had plentiful possessions and valuables, and owned numerous gems, pearls, beryl stones, conches, crystals, and pieces of coral, gold, and silver.

source: འདོན་པ། གཞུང་འཛིན་པ། སྒྲ་ངེས་པར་སྦྱོར་བ་དང་བཅས་པ། ཤེས་གསལ་དང་བཅས་པ། ཡི་གེ་དང་བཅས་པ། རབ་ཏུ་དབྱེ་བ་དང་། ལྔ་པ་སྔོན་བྱུང་བ་རྣམས་དང་། གནས་དང་། ལུང་སྟོན་པ་དང་། འཇིག་རྟེན་རྒྱང་ཕན་དང་། མཆོད་སྦྱིན་གྱི་རྒྱུད་དང་།
en: He had been educated in the recitation and upholding of scripture, as well as linguistics, Kaiṭabha literature, grammar, divisions, the Fifth, the topics of the past adepts, rhetoric, the Lokāyata system, and the scriptures on sacrifice.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉིད་དང་། རིག་པ་གསུམ་གྱི་ཁམས་དགེ་མཚན་དང་ལྡན་ཞིང་། དགེ་བ་གང་ཡིན་པ་ཚོལ་བ་རང་གི་སློབ་དཔོན་གྱིས་འཐུན་པའི་རྒྱུད་གནང་ཞིང་དམ་བཅས་པ་ཞིག་བྱུང་ངོ་། །
en: He possessed the characteristics of great men and the good qualities of three types of knowledge. He sought the meaning of virtue. He had been authorized in the corresponding scriptures by his teachers and was bound by commitment.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ནས།
en: “At that time there had appeared in the world a thus-gone one named Ambrosial King;

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་རྩིའི་རྒྱལ་པོ་དེའི་སྐུ་ཚེའི་ཚད་ལོ་བདུན་སྟོང་དུ་གྱུར་ཏོ། །
en: The Thus-Gone One would live to be seven thousand years.

source: ཉན་ཐོས་འདུས་པ་ལྔ་བྱུང་སྟེ།
en: He had five assemblies of hearers.

source: ཉན་ཐོས་འདུས་པ་གཅིག་ནི་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། མཉམ་པ་ཉིད་ཤེས་པས་རྣམ་པར་གྲོལ་བའི་བར་དུ་དུང་ཕྱུར་ཕྲག་དགུ་བྱུང་ངོ་། །
en: The first assembly numbered nine hundred million, and all of them were worthy ones whose defilements were exhausted . . . and who were liberated by their insight into equality.

source: འདུས་པ་གཉིས་པ་ནི་དུང་ཕྱུར་ཐམ་པའོ། །
en: The second assembly numbered one hundred million,

source: འདུས་པ་གསུམ་པ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་སྟོང་བྱུང་ངོ་། །
en: the third assembly consisted of one hundred billion worthy ones,

source: འདུས་པ་བཞི་པ་དང་ལྔ་པ་ལ་ཉན་ཐོས་དགྲ་བཅོམ་པ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་། །
en: while the fourth and fifth assemblies consisted of countless billions of worthy hearers.

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་གསུམ་བྱུང་སྟེ། དེའི་ཉིས་འགྱུར་རོ། །
en: He also had three assemblies of bodhisattvas, which were double that number.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་མི་དམན་པ་ཅན་ཞེས་བྱ་བ་སངས་རྒྱས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: “Within that buddha realm there was a bodhisattva named Non-Deficiency of Mind, who had created roots of virtue with countless tens of thousands of buddhas.

source: ཨེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་མུན་པར་གྱུར་པ་ཡིན་ཏེ།
en: ‘Alas! Those living in the world are in darkness.

source: གང་སྐྱེ་བའི་ཆོས་རྣམས་འགོག་པར་མི་མཐོང་ལ་འགགས་པ་རྣམས་ཀྱང་མི་སྐྱེ་བར་རྣམ་པར་མི་ཤེས་སོ། །
en: They do not see that things that come into being must also cease, nor do they understand that all that ceases is also unborn.

source: ཆོས་གང་དག་སྐྱེ་ལ་དེ་དག་འགོག་ཅིང་མི་སྐྱེ་བ་མི་མཐོང་ལ་རྣམ་པར་མི་ཤེས་སོ། །
en: They do not see or understand that whatever is born ceases, and therefore in fact is unborn.

source: འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་སུ་ཡོད་གང་དེའི་དྲུང་དུ་བདག་སོང་སྟེ།
en: Who are the ascetics and brahmins in the world now?

source: ཡོངས་སུ་དྲི་བར་བྱའོ་སྙམ་པ་ལས་བར་སྣང་ལས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ཐིགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ།
en: I must go to them and ask them questions.’ “As he had this thought, he heard a voice in the sky: ‘The thus-gone named Ambrosial King has appeared in the world!

source: ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ་དེ་མི་མཁྱེན་པའམ། ཐུགས་སུ་མ་ཆུད་པའམ། མ་གཟིགས་པ་ཅི་ཡང་མེད་ལ།
en: He is omniscient and all-seeing . There is nothing whatsoever that he has not understood, has not realized, and has not perceived.

source: དེ་འགགས་པའི་ཆོས་རྣམས་ཀྱི་མི་འགྲོ་བ་མེད་པར་རབ་ཏུ་མཁྱེན་པ་ཞིག་འཇིག་རྟེན་དུ་བྱུང་ངོ་ཞེས་དེས་ཐོས་སོ། །
en: He fully understands the absence of movement with regard to the phenomena of cessation.’

source: མི་དམན་པ་བདག་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ཐིགས་པའི་རྒྱལ་པོའི་དྲུང་དུ་སོང་སྟེ། དོན་འདི་ཡོངས་སུ་ཞུ་བར་བྱའོ། །
en: ‘I, Non-Deficiency, will go before the thus-gone Ambrosial King and ask him about these things.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཇི་ལྟ་བ་བཞིན་དུ་ལུང་སྟོན་ཏེ། བདག་གིས་དོན་དེ་ལྟར་གཟུང་བར་བྱའོ་སྙམ་མོ། །
en: The Thus-Gone One will answer correctly and I will keep his answers in mind.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་མི་དམན་པ་ཅན་དེ་སྐྱེ་བོའི་ཚོགས་མང་པོ་དང་ལྷན་ཅིག །བྲམ་ཟེ་འབུམ་ཕྲག་དྲུག་དང་། རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཁྲི་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་ལྷན་ཅིག །དེ་དག་ལ་སོགས་པ་བྲམ་ཟེ་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ཐིགས་པའི་རྒྱལ་པོ་དེ་ག་ལ་བ་དེར་དོང་ངོ་། །
en: “The bodhisattva called Non-Deficiency of Mind then went before the thus-gone Ambrosial King along with myriad other beings, including six hundred thousand brahmins, eight hundred forty thousand great householders of the warrior caste, and innumerable tens of thousands of brahmins.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ཐིགས་པའི་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་མི་དམན་པ་ཅན་དེ་སྐྱེ་བོའི་ཚོགས་མང་པོ་དག་དང་ལྷན་ཅིག་ཏུ་རྒྱང་རིང་པོ་ཉིད་ནས་འོང་བ་གཟིགས་སོ། །
en: The thus-gone Ambrosial King saw the bodhisattva Non-Deficiency of Mind and the masses of other beings approaching in the distance.

source: གཟིགས་ནས་ཀྱང་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ། མངོན་པར་འདུ་མཛད་པས། ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གསེར་གྱི་འོད་ཀྱི་མདོག་གིས་རྒྱས་པར་མཛད་དོ། །
en: As he watched them, he used his miraculous powers to fill the entire buddha realm with a golden light .

source: ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས། འདི་དག་ནི་ལྷ། འདི་དག་ནི་མི་ཞེས་ལྷ་དང་མི་རྣམས་ཀྱི་བྱེ་བྲག་གམ། ཐ་དད་ཏུ་བྱ་བ་མེད་དོ། །
en: Then, using his miraculous abilities again, he made it so that there was no distinction or difference between gods and humans, that is to say, no one thought, ‘These are gods, while these over here are humans.’

source: སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་དག་ཐ་ན་སེམས་ཅན་གང་གི་ལུད་པའི་སྒྲ་ཡང་མེད་པར་མཛད་དེ། འཁོར་དེ་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །
en: The huge multitude of beings comprising the entourage became utterly quiet, such that there was not even the sound of a single being clearing their throat.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་མི་དམན་པ་ཅན་གྱིས་འཁོར་དེ་དག་རབ་ཏུ་ཞི་བ་རིག་ཅིང་སྒྲ་འབྱུང་བ་མ་ཐོས་ནས། དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “When the bodhisattva Non-Deficiency of Mind noticed how calm the group had become and heard the silence, he thought,

source: སྒྲ་གང་དག་འབྱུང་བ་མེད་ན་དེ་དག་འགོག་པ་མེད་ཆོས་གང་དག་འགགས་ན།
en: ‘Whatever sound does not arise, does not cease.

source: དེ་གང་ཡང་སྐྱེ་བ་མེད་དོ་སྙམ་མོ། །
en: Whatever has ceased is also unborn.’

source: འདི་ལྟར་སྒྲ་འབྱུང་བ་མེད་ན་འགག་པ་མེད་དེ།
en: ‘Thus if a sound does not arise, it does not cease.

source: མེད་པའི་ཕྱིར་ངེས་པར་འགོག་པའི་ཆོས་ཀྱང་མེད་ལ། དེ་ཡང་དག་པར་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་སྐྱེ་བ་མེད་དོ་སྙམ་མོ། །
en: Since it is non-existent, there is no thing that really ceases. Because there is no real existence, there is also no birth.’

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He then wondered,

source: ཆོས་འདི་དག་གང་སྐྱེས་པ་དེ་དག་གི་རང་བཞིན་ཅི་ཡིན་དེ་འདི་ལྟར་བློ་སྐྱེས་ཏེ།
en: ‘What is the nature of these phenomena that arise?’ before the insight came to him:

source: སྲིད་པའི་ཆོས་སྐྱེས་པ་འདི་དག་གི་རང་བཞིན་གང་ཡང་མེད་དེ།
en: ‘These arising phenomena of existence have no real nature.

source: འདི་དག་སྐྱེས་པ་མེད་ལ་འགགས་པ་ཡང་མེད་དོ་སྙམ་མོ། །
en: They are unborn and unceasing.’

source: དེ་དེའི་ཚེ་ཆོས་དེ་དག་གི་རང་བཞིན་མ་དམིགས་པ་ན། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: When in that moment he did not apprehend any nature of phenomena, he achieved acceptance that phenomena are unborn.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ཐིགས་པའི་རྒྱལ་པོ་དེས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་མི་དམན་པ་ཅན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་ཐུགས་སུ་ཆུད་ནས།
en: Then, realizing that the bodhisattva called Non-Deficiency of Mind had achieved acceptance that phenomena are unborn, the thus-gone Ambrosial King gave his approval:

source: ལེགས་སོ་ཞེས་བྱ་བ་རྗེས་སུ་གནང་སྟེ།
en: ‘Wonderful!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འདི་ལྟར་ཆོས་འདིའི་དོན་ཇི་ལྟ་བ་བཞིན་རྣམ་པར་ཤེས་པ་རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Noble son, how excellent that you have come to understand phenomena correctly.’

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་མི་དམན་པ་ཅན་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva named Non-Deficiency of Mind was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་མི་དམན་པ་ཅན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva named Non-Deficiency of Mind.

source: དགེ་བའི་རྩ་བ་དེས་ང་བསྐལ་པ་གྲངས་མེད་པ་བདུན་ཅུ་རྩ་དྲུག་ཏུ་ནམས་ཀྱང་ལོག་པར་མ་ལྷུང་། ནམས་ཀྱང་ཆོས་ལ་མ་རྨོངས།
en: Due to those roots of virtue, for seventy-six incalculable eons I did not fall astray or become confused about the Dharma.

source: ནམས་ཀྱང་མི་དགེ་བའི་སེམས་ཆགས་པ་ལས་སྐྱེས་པའམ། ཞེ་སྡང་ལས་སྐྱེས་པའམ། གཏི་མུག་ལས་སྐྱེས་པ་མ་བྱུང་ངོ་། །
en: I never had an unwholesome state of mind, whether born of attachment, born of anger, or born of stupidity.

source: རྟག་པར་རྒྱུན་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་སུ་རབ་ཏུ་ཞུགས་ཏེ།
en: I constantly rested my mind within omniscience.

source: སེམས་དང་བ་དེས་ངའི་བག་ཆགས་སྤངས་སོ། །
en: Due to such lucidity of mind, I was able to leave behind my habitual tendencies.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་རྣམས་ཀྱི་འགོག་པ་སོ་སོར་བརྟག་པར་བྱ་སྟེ།
en: Therefore, Maudgalyāyana, bodhisattvas should discern the cessation of phenomena;

source: བག་ཆགས་ཡང་དག་པར་འཇོམས་པར་འགྱུར་རོ། །
en: thus will habitual tendencies be overcome.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་བྱང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created countless different roots of virtue in order to understand the path leading to cessation as related to purification. I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood, and then teach beings correctly?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དྲི་མེད་དབང་བསྐུར་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a spiritually inclined Dharma king named Immaculate Consecration.

source: རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ།
en: He held the seven treasures, and so forth.

source: ཤིན་ཏུ་གནས་པའི་བར་དུའོ། །དེ་འཇིག་རྟེན་གང་དག་ན་དགེ་སྦྱོང་དང་བྲམ་ཟེའི་དབེན་པའི་གནས་མལ་ན་འདུག་ཅིང་དེ་བློན་པོ་གཉིས་དང་། དེ་ལས་གཞན་པའི་མཁས་པ་ཀུན་དང་རྣམ་པར་དཔྱོད་པར་བྱེད། ཡོངས་སུ་འདྲི་བར་བྱེད་དོ། །
en: He investigated and inquired, along with his two ministers and other experts, as to where in the world the secluded hermitages of the ascetics and brahmins were.

source: དེའི་ཚེ་རྒྱལ་པོ་དྲི་མེད་དབང་བསྐུར་དེ་དང་ཉེ་བ་ཞིག་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་ཞིག་བཞུགས་སོ། །
en: “At the same time, in the vicinity of King Immaculate Consecration was a thus-gone one named Vimalanetra; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་ཆོས་སྟོན་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་ཡང་དགེ་བ། དོན་བཟང་པོ། །ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཚངས་པར་སྤྱོད་པ་རབ་ཏུ་སྟོན་ཏོ། །
en: He was a Dharma teacher whose instructions were good in the past, good in the middle, good in the end, of excellent meaning, and with excellent words—unmixed, complete, pure, and chaste.

source: རྒྱལ་པོ་དྲི་མེད་དབང་བསྐུར་དེ་འདི་དང་ཉེ་བ་ཞིག་ན། དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཞེས་བྱ་བ་ཆོས་སྟོན་ཏོ་ཞེས་ཐོས་སོ། །
en: King Immaculate Consecration heard that the thus-gone Vimalanetra was teaching the Dharma in his area[, and that in the Thus-Gone One’s retinue was a saṅgha of innumerable monks].

source: དེ་བཞིན་གཤེགས་པའི་འཁོར་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་ཅེས་དེ་སྐད་ཀྱང་ཐོས་སོ། །
en: [King Immaculate Consecration] heard [that the thus-gone Vimalanetra was teaching the Dharma in his area, and] that in the Thus-Gone One’s retinue was a saṅgha of innumerable monks.

source: ཐོས་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When he heard this news, he thought,

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་ངེས་པར་ཐུན་མོང་མ་ཡིན་པའི་ཡེ་ཤེས་དང་ལྡན་པས་མཁས་པའོ། །
en: ‘The Thus-Gone One is wise, as he surely possesses extraordinary wisdom.

source: གང་གི་འཁོར་དེ་སྙེད་ཅིག་ཡོད་པ་དེ་ལ་ཆོས་དང་འཐུན་པས་ཕྱིར་བརྒལ་བར་འདི་ལ་སུ་ཡང་ནུས་པ་མེད་དོ། །
en: Since someone with a retinue as big as his must be in harmony with the Dharma, no one will be able to repudiate him.

source: གང་བདག་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེའི་དྲུང་དུ་སོང་སྟེ། རྣམ་པར་བྱང་བ་ཤེས་པ་ཡང་དག་པར་འདུ་བ་ཤེས་པ་ཡོངས་སུ་ཞུ་བར་བྱའོ་
en: I will go before the thus-gone Vimalanetra, and ask him about knowledge of gathering as related to knowledge of purification.’

source: སྙམ་ནས་དེ་སྲོག་ཆགས་འབུམ་ཕྲག་བརྒྱད་དང་ལྷན་ཅིག་བློན་པོ་སྟོང་ཐམ་པ་དང་ལྷན་ཅིག །བུད་མེད་འབུམ་ཕྲག་བརྒྱད་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ག་ལ་བ་དེར་དོང་ངོ་། །
en: “With that in mind, he went before the thus-gone Vimalanetra along with eight hundred thousand other beings, one thousand ministers, and eight hundred thousand wives.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་ལ་ཆོས་སྟོན་ཏེ།
en: At that time the Thus-Gone One was teaching the Dharma, while surrounded by countless tens of thousands of beings.

source: འཁོར་དེ་སྒྲ་ཆུང་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམས་ཤིང་རྣ་བ་བླགས་ཏེ་ཆོས་ཉན་ཏོ། །
en: The audience was silent and listening attentively with their ears perked, with all sentient beings in mind.

source: དེའི་ཚེ་འཁོར་གྱི་དཀྱིལ་འཁོར་དེའི་ནང་ན་སྒྲ་ཐ་ན་ལུད་པའི་སྒྲ་ཙམ་ཡང་མེད་དོ། །
en: Not even the sound of someone clearing their throat arose among anyone in the crowd.

source: རྒྱལ་པོ་དེ་སྔོན་གྱི་དགེ་བའི་རྩ་བ་བསགས་པས་དེ་བུད་མེད་འབུམ་ཕྲག་བརྒྱད་ཀྱི་ནང་ན་འདུག་བཞིན་དུ་བསམ་གཏན་བཞི་པའི་བར་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Due to having gathered roots of virtue in the past, the king was able to remain in equilibrium up to the fourth concentration while surrounded by his eight hundred thousand women.

source: དེས་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བ་ཙམ་ཉིད་ཀྱིས་དབང་པོ་དེ་དག་ཞི། སྤྱོད་ལམ་ཞི་བར་ཤེས་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་གཞལ་དུ་མེད་པའི་དགའ་བ་བསྐྱེད་ཅིང་།
en: Merely beholding the Thus-Gone One, he noticed how his senses and demeanor were calm, and thus felt unfathomable appreciation for the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པ་དེའི་འཁོར་འདི་སྙེད་ཅིག་ཡོད་པ་ལ་ཕྱིར་བརྒལ་བར་སུས་ཀྱང་མི་ནུས་སོ། །
en: He then reflected, ‘With such a large following, it is impossible that someone could repudiate the Thus-Gone One.

source: འཁོར་འདི་སྙེད་ཅིག་ཡོད་པའི་ཕྱིར་རོ།
en: Because his following is so large.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱོད་ལམ་ཞི་སྟེ།
en: The Thus-Gone One’s demeanor is so calm.

source: སྤྱོད་ལམ་དེ་དང་འདྲ་བ་གང་ཡང་མེད་དོ། །
en: No one else has a demeanor like his.

source: ཐུན་མོང་མ་ཡིན་ནོ། །
en: It is extraordinary!

source: རྣམ་གྲངས་དེས་ན་དེ་བཞིན་གཤེགས་པ་དེ་ནི་ཐེ་ཙོམ་མེད་པར་ཐུན་མོང་མ་ཡིན་པའི་ཡེ་ཤེས་དང་ལྡན་པའོ་སྙམ་མོ། །
en: Without a doubt the Thus-Gone One possesses extraordinary wisdom.’

source: དེ་འཁོར་དེ་དག་དང་བཙུན་མོའི་འཁོར་དེ་དག་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ག་ལ་བ་དེར་དོང་ངོ་། །
en: “He then approached the Thus-Gone One along with his entourage and retinue of queens.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་གྱིས་རྒྱང་རིང་པོ་ཉིད་ནས་འདི་སྐད་བཀའ་སྩལ་ཏེ།
en: The thus-gone Vimalanetra greeted him from a distance, saying,

source: རྒྱལ་པོ་ཆེན་པོ་ཚུར་སྤྱོན་རྒྱལ་པོ་ཆེན་པོ་ལེགས་པར་བྱོན་ཏོ། །
en: ‘Your Highness, come nearer; be welcome, Your Highness!

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་བྱ་བའི་ཕྱིར། ཡུན་རིང་པོ་ནས་འབད་པར་བྱས་སོ། །
en: Your Highness, you have labored a long time to see the Thus-Gone One.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་མཐོང་ནས་དོན་ཡོད་པར་འགྱུར་རོ། །
en: Your Highness, it is not in vain that you have come to see the Thus-Gone One.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་འབྲས་བུ་དང་བཅས་པར་འགྲོ་ཞིང་།
en: Your Highness, you will leave with your reward.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཞུས་པ་ལུང་བསྟན་པས་བརྣག་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Receiving the Thus-Gone One’s reply to your question, your purpose will be fulfilled.’

source: དེ་ནས་རྒྱལ་པོ་དྲི་མེད་དབང་བསྐུར་དེས་འཁོར་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: “King Immaculate Consecration and his entourage then bowed their heads at the Thus-Gone One’s feet, before then sitting off to one side.

source: དེའི་ཚེ་ཚངས་རིས་ཀྱི་ལྷ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དེ་བཞིན་གཤེགས་པ་དེའི་སྟེང་གི་བར་སྣང་ལ་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་དོ། །
en: At that point, eight hundred million gods from the Brahmā Realm manifested in the sky above the Thus-Gone One, all of them with their palms together.

source: འདོད་པ་ན་སྤྱོད་པའི་ལྷ་གང་དག་གི་མིག་གིས་ཀྱང་མཐོང་བར་མི་འགྱུར་ན། མིར་གྱུར་པས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: They were invisible even to the gods of the desire realm, no need to mention humans.
